src/InformationRegisters/ИсторияОбменовПоСообщениям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ИсторияОбменовПоСообщениям</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ХранилищеСообщения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КоличествоОбъектов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьОшибкиПоОбъектам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланОбменаПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НомерСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Узел</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исходящее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИсторияОбменовПоОбъектам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ИсторияОбменовПоОбъектам</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ХранилищеСообщения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИмяМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокОшибок</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НомерСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Узел</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исходящее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/МенеджерыТорговыхТочек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>МенеджерыТорговыхТочек</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Менеджеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеТочки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидМенеджера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМенеджеров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Comment>Представление</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначенияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресЭП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоменноеИмяСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерТелефонаБезКодов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДляСписка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Менеджеры</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Изготовители</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
						<v8:Type>cfg:CatalogRef.ТорговыеТочки</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеКонтакты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Comment>Тип</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Comment>Вид</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/КритическиеСобытияСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>КритическиеСобытияСистемы</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтправлятьОповещение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительноеОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСеанса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Компьютер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСеанса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоВозникновения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыВызова</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИсточникКритическогоСобытия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИсточникКритическогоСобытия</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СобытияДляОтправкиЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ВидыМенеджеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыМенеджеров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Снабжения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамМенеджераСнабжения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамМенеджераПродажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлючевыхКлиентов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/БонусыПоставщиковСервер/Ext/Module.bsl
// 15.04.19 Строганов Роман > 
Функция ВыгрузитьВОкноПоставщика(СсылкаНаОбъект, СтруктураАдресаФайлов) Экспорт
	
	лКлючАлгоритма = "ОбщийМодуль_БонусыПоставщиковСервер_ВыгрузитьВОкноПоставщика";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	///////////////////////////////////////////////////////////////////////////	
	
	Если ОбщегоНазначения.ЭтоРабочаяИнформационнаяБаза() Тогда 
		ИмяРеквизита = "СтрокаДляРабочейБазы";
	Иначе
		ИмяРеквизита = "СтрокаДляТестовойБазы";
	КонецЕсли;
		
	КаталогФайловДляСайта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Справочники.НастройкиРеквизитовДляОбменов.КаталогФайловДляСайта, ИмяРеквизита);
	
	Попытка
		КопироватьФайл(СтруктураАдресаФайлов.ПолноеИмяФайла, КаталогФайловДляСайта + СтруктураАдресаФайлов.ИмяФайла);
		КопироватьФайл(СтруктураАдресаФайлов.ПолноеИмяФайлаРасшВедомость, КаталогФайловДляСайта + СтруктураАдресаФайлов.ИмяФайлаРасшВедомость);
	Исключение
		ВызватьИсключение "Не удалось скопировать файл." + ОписаниеОшибки();
	КонецПопытки;
	
	ДатаВремяОбновленияАкта = СтрЗаменить(ПеревернутьДату(ТекущаяДатаСеанса()), " ", "") + " " + СокрЛП(Формат(ТекущаяДатаСеанса(), "ДЛФ=T")); 
	ДатаВремяОбновленияВедомости = СтрЗаменить(ПеревернутьДату(ТекущаяДатаСеанса()), " ", "") + " " + СокрЛП(Формат(ТекущаяДатаСеанса(), "ДЛФ=T"));
	
	СтрокаПодключенияADO = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Справочники.НастройкиРеквизитовДляОбменов.СтрокаПодключенияADO, ИмяРеквизита);
	
	АдресСервераMySQL = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Справочники.НастройкиРеквизитовДляОбменов.АдресСервераОП, ИмяРеквизита); 
	ИмяБазы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Справочники.НастройкиРеквизитовДляОбменов.ИмяБазыОП, ИмяРеквизита);
	ИмяПользователя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Справочники.НастройкиРеквизитовДляОбменов.ИмяПользователяОП, ИмяРеквизита);
	ПарольПользователя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Справочники.НастройкиРеквизитовДляОбменов.ПарольОП, ИмяРеквизита);
	
	Если Не ЗначениеЗаполнено(АдресСервераMySQL) Тогда 
		ВызватьИсключение "В константах не заполнен адрес сервера MySQL";
	КонецЕсли;
	
	СтрокаПодключенияADO = СтрЗаменить(СтрокаПодключенияADO, "%АдресСервера%", АдресСервераMySQL);
	СтрокаПодключенияADO = СтрЗаменить(СтрокаПодключенияADO, "%ИмяБазы%", ИмяБазы);
	СтрокаПодключенияADO = СтрЗаменить(СтрокаПодключенияADO, "%ИмяПользователя%", ИмяПользователя);
	СтрокаПодключенияADO = СтрЗаменить(СтрокаПодключенияADO, "%ПарольПользователя%", ПарольПользователя);
	
	ADOСоединение  = Новый COMОбъект("ADODB.Connection");
	ADOСоединение.ConnectionString = СтрокаПодключенияADO;
	ADOСоединение.ConnectionTimeout = 30;
	ADOСоединение.CommandTimeout = 6000;

	Попытка
		ADOСоединение.Open();
	Исключение
		ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки; 
	
	RS = Новый ComОбъект("ADODB.Recordset"); 
	
	ИмяТаблицы = "import_bonus";
	
	ТекНомерДок = СсылкаНаОбъект.Номер + "_" + СокрЛП(Формат(Год(СсылкаНаОбъект.Дата), "ЧГ=0")); 
	
	ТекстЗапроса_Поиск = "SELECT * FROM "+ИмяТаблицы+" WHERE act_number = '"+ТекНомерДок+"'";
	
	RS.Open(ТекстЗапроса_Поиск, ADOСоединение);
	
	ТекстЗапроса_Добавление = "INSERT INTO "+ ИмяТаблицы +"(act_number) VALUES ('"+ ТекНомерДок + "')";
	
	Command = Новый COMОбъект("ADODB.Command");
	Command.CommandTimeout = 100;
	Command.CommandText = ТекстЗапроса_Поиск;
	Command.CommandType = 1;
	Command.ActiveConnection = ADOСоединение;
	
	Попытка
		Command.Execute();
	Исключение
		ВызватьИсключение 
		"Ошибка выгрузки бонусов в «Окно поставщика». 
		|Запрос к таблицам MySQL на сайте вызвал ошибку. 
		|Описание ошибки: " + ОписаниеОшибки();
	КонецПопытки;
	
	Если RS.EOF() Тогда
		
		Command = Новый COMОбъект("ADODB.Command");
		Command.CommandTimeout = 100;
		Command.CommandText = ТекстЗапроса_Добавление;
		Command.CommandType = 1;
		Command.ActiveConnection = ADOСоединение;
		
		Попытка
			Command.Execute();
		Исключение
			ВызватьИсключение 
			"Ошибка выгрузки бонусов в «Окно поставщика». 
			|Запрос к таблицам MySQL на сайте вызвал ошибку. 
			|Описание ошибки: " + ОписаниеОшибки();
		КонецПопытки;
		
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КорректировкаДолга.ДатаАкта КАК ДатаАкта,
	|	КорректировкаДолга.КонтрагентДебитор КАК Контрагент,
	|	КорректировкаДолга.ПериодАнализаНачало КАК ПериодАнализаНачало,
	|	КорректировкаДолга.ПериодАнализаОкончание КАК ПериодАнализаОкончание,
	|	КорректировкаДолга.ПроцентБонуса КАК ПроцентБонуса,
	|	ЕСТЬNULL(ВложенныйЗапрос.Сумма, 0) КАК СуммаПремии,
	|	КорректировкаДолга.СканПолучен КАК СканПолучен,
	|	КорректировкаДолга.ОригиналПолучен КАК ОригиналПолучен,
	|	КорректировкаДолга.ДатаПолученияОригинала КАК ДатаПолученияОригинала
	|ИЗ
	|	Документ.КорректировкаДолга КАК КорректировкаДолга
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			КорректировкаДолгаСуммыДолга.Ссылка КАК Ссылка,
	|			СУММА(КорректировкаДолгаСуммыДолга.Сумма) КАК Сумма
	|		ИЗ
	|			Документ.КорректировкаДолга.СуммыДолга КАК КорректировкаДолгаСуммыДолга
	|		
	|		СГРУППИРОВАТЬ ПО
	|			КорректировкаДолгаСуммыДолга.Ссылка) КАК ВложенныйЗапрос
	|		ПО КорректировкаДолга.Ссылка = ВложенныйЗапрос.Ссылка
	|ГДЕ
	|	КорректировкаДолга.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ТекстЗапроса_Обновление = "";
	
	Если ЗначениеЗаполнено(СтруктураАдресаФайлов.ИмяФайла) Тогда
		ТекстЗапроса_Обновление = ТекстЗапроса_Обновление + ", act_file = '" + СтруктураАдресаФайлов.ИмяФайла +"'";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураАдресаФайлов.ИмяФайлаРасшВедомость) Тогда
		ТекстЗапроса_Обновление = ТекстЗапроса_Обновление + ", vedomost_file = '"+ СтруктураАдресаФайлов.ИмяФайлаРасшВедомость +"'";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаВремяОбновленияАкта) Тогда
		ТекстЗапроса_Обновление = ТекстЗапроса_Обновление + ", act_file_date = '"+ ДатаВремяОбновленияАкта+"'";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаВремяОбновленияВедомости) Тогда
		ТекстЗапроса_Обновление = ТекстЗапроса_Обновление + ", vedomost_file_date = '"+ ДатаВремяОбновленияВедомости + "'";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.ДатаАкта) Тогда
		ТекстЗапроса_Обновление = ТекстЗапроса_Обновление + ", act_date = '"+ПеревернутьДату(СсылкаНаОбъект.ДатаАкта)+"'";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.СуммаПремии) Тогда
		ТекстЗапроса_Обновление = ТекстЗапроса_Обновление + ", act_sum = '"+XMLСтрока(Выборка.СуммаПремии)+"'";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.Контрагент) Тогда
		ТекстЗапроса_Обновление = ТекстЗапроса_Обновление + ", supplier_code = '"+ СокрЛП(Выборка.Контрагент.Код)+"'";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.ПериодАнализаНачало) Тогда
		ТекстЗапроса_Обновление = ТекстЗапроса_Обновление + ", period_start = '"+ПеревернутьДату(Выборка.ПериодАнализаНачало)+"'";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.ПериодАнализаОкончание) Тогда
		ТекстЗапроса_Обновление = ТекстЗапроса_Обновление + ", period_end = '"+ПеревернутьДату(Выборка.ПериодАнализаОкончание)+"'";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.СканПолучен) Тогда
		ТекстЗапроса_Обновление = ТекстЗапроса_Обновление + ", has_scan = '"+ ?(Выборка.СканПолучен, 1, 0) +"'";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.ОригиналПолучен) Тогда
		ТекстЗапроса_Обновление = ТекстЗапроса_Обновление + ", has_original = '"+ ?(Выборка.ОригиналПолучен, 1, 0)+"'";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.ДатаПолученияОригинала) Тогда
		ТекстЗапроса_Обновление = ТекстЗапроса_Обновление + ", original_date = '"+?(ЗначениеЗаполнено(Выборка.ДатаПолученияОригинала), Выборка.ДатаПолученияОригинала, "0000-00-00") +"'";
	КонецЕсли;
	
	ТекстЗапроса_Обновление = Сред(ТекстЗапроса_Обновление, 2);
	
	ТекстЗапроса_Обновление = "UPDATE "+ИмяТаблицы+" SET " + ТекстЗапроса_Обновление + " WHERE act_number = '"+ТекНомерДок+"'";

	Command = Новый COMОбъект("ADODB.Command");
	Command.CommandTimeout = 100;
	Command.CommandText = ТекстЗапроса_Обновление;
	Command.CommandType = 1;
	Command.ActiveConnection = ADOСоединение;
	
	Попытка
		Command.Execute();
	Исключение
		ВызватьИсключение 
		"Ошибка выгрузки бонусов в «Окно поставщика». 
		|Запрос к таблицам MySQL на сайте вызвал ошибку. 
		|Описание ошибки: " + ОписаниеОшибки();
	КонецПопытки;
	
	// Документ выгрузили, теперь надо в специальную таблицу записать об этом
	
	КодТаблицы 	= "import_bonus";
	КодЗаписи 	= "bonus";
	
	ТекстЗапроса_Добавление = "INSERT INTO exchange_messages (date_created,`table`,record_id,operation,source) VALUES (NOW(), '"+КодТаблицы+"', '"+ТекНомерДок+"', '"+КодЗаписи+"','1С');";
	
	Command = Новый COMОбъект("ADODB.Command");
	Command.CommandTimeout = 100;
	Command.CommandText = ТекстЗапроса_Добавление;
	Command.CommandType = 1;
	Command.ActiveConnection = ADOСоединение;
	
	ОбменДаннымиКлиентСервер.НачатьЗаписьВИсториюОбменовПоОбъектам();
	
	Попытка
		Command.Execute(); 
		
		ОбменДаннымиКлиентСервер.ДобавитьСтрокуИсторииПоОбъекту(СсылкаНаОбъект, "");
		
		Узел = ОбменССайтомСервер.УзелПланаОбмена("ОбменПартКом83_ОкноПоставщика", Истина);
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИсторияОбменовПоСообщениям.НомерСообщения
		|ИЗ
		|	РегистрСведений.ИсторияОбменовПоСообщениям КАК ИсторияОбменовПоСообщениям
		|ГДЕ
		|	ИсторияОбменовПоСообщениям.Узел = &Узел
		|	И НЕ ИсторияОбменовПоСообщениям.Исходящее
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИсторияОбменовПоСообщениям.НомерСообщения УБЫВ");
		
		Запрос.УстановитьПараметр("Узел", Узел); 
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		
		СтруктураЗаписи = Новый Структура;
		СтруктураЗаписи.Вставить("НомерСообщения", Выборка.НомерСообщения);
		СтруктураЗаписи.Вставить("Период", ТекущаяДатаСеанса());
		СтруктураЗаписи.Вставить("Исходящее", Ложь);
		СтруктураЗаписи.Вставить("Узел", Узел);
		СтруктураЗаписи.Вставить("ХранилищеСообщения", Неопределено);

		РегистрыСведений.ИсторияОбменовПоОбъектам.СоздатьЗаписиПоСообщению(СтруктураЗаписи, ОбменДаннымиКлиентСервер.ПолучитьТаблицуИсторииИзПараметраСеанса());
		
	Исключение
		ВызватьИсключение 
		"Ошибка выгрузки бонусов в «Окно поставщика». 
		|Запрос к таблицам MySQL на сайте вызвал ошибку. 
		|Описание ошибки: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	ADOСоединение.Close();
	
КонецФункции

Функция ПеревернутьДату(Знач ТекДата, Дата_сВременем = 0) Экспорт
	
	// должно быть так '2011-04-05' (причем можно и так '2011-4-5')
	
	Если Дата_сВременем = 0 Тогда
		Тмп = "" + Формат(Год(ТекДата), "ЧГ=0") + "-" + Месяц(ТекДата) + "-" + День(ТекДата);
	Иначе
		//с 28.01.2016 (проект "новые 4 срока")
		Тмп = ПеревернутьДату(Дата(Лев(ТекДата, 10))) + Сред(ТекДата, 11);
	КонецЕсли;
	
	Возврат Тмп;
	
КонецФункции

Функция ЗаписатьФайлыДляВыгрузкиОтправкиПоставщикам(ДокументСсылка) Экспорт
	
	лКлючАлгоритма = "ОбщийМодуль_БонусыПоставщиковСервер_ЗаписатьФайлыДляВыгрузкиОтправкиПоставщикам";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	///////////////////////////////////////////////////////////////////////////
	
	Если Не ЗначениеЗаполнено(ДокументСсылка) Тогда
		ВызватьИсключение "Не заполнен документ для формирования документов по премии 2%";	
	КонецЕсли;
	
	лок_ТекущаяДата = ТекущаяДатаСеанса();
	КаталогФайлов = КаталогВременныхФайлов() + "SYSLOG\Bonus\";
	
	Файл = Новый Файл(КаталогФайлов);
	Если Не Файл.Существует() Тогда
		СоздатьКаталог(КаталогФайлов);
	КонецЕсли;
	
	КаталогФайлов = КаталогФайлов + Год(лок_ТекущаяДата)+"-"+Месяц(лок_ТекущаяДата)+"-"+День(лок_ТекущаяДата)+"\";
	Файл = Новый Файл(КаталогФайлов);
	Если Не Файл.Существует() Тогда
		СоздатьКаталог(КаталогФайлов);
	КонецЕсли;
	
	КаталогФайлов = КаталогФайлов + СокрЛП(ДокументСсылка.КонтрагентДебитор.Код) + "\";
	Файл = Новый Файл(КаталогФайлов);
	Если Не Файл.Существует() Тогда
		СоздатьКаталог(КаталогФайлов);
	КонецЕсли;
	
	// Акт о предоставлении премии
	ИмяФайла = "Акт_" + СокрЛП(ДокументСсылка.Номер) + "_" + СтрЗаменить(Формат(ДокументСсылка.Дата, "ДФ=dd.MM.yyyy"), ".","") + "_" + СтрЗаменить(Прав(ТекущаяДата(), 8), ":","" ) + ".pdf";
	ПолноеИмяФайла = КаталогФайлов + ИмяФайла ;
	
	ПечатнаяФорма = Справочники.ВнешниеОбработки.НайтиПоНаименованию("Акт о предоставлении премии");
	ОбработкаОбъект = ПечатнаяФорма.ПолучитьОбъект();
	
	ИмяФайлаОтчета = ПолучитьИмяВременногоФайла("epf");
	ДанныеОбработки = ОбработкаОбъект.ХранилищеВнешнейОбработки.Получить();
	ДанныеОбработки.Записать(ИмяФайлаОтчета); 
	
	ПечатнаяФорма = ВнешниеОбработки.Создать(ИмяФайлаОтчета);
	ТабличныйДокумент = ПечатнаяФорма.Печать(ДокументСсылка);
	
	Попытка
		ТабличныйДокумент.Записать(ПолноеИмяФайла, ТипФайлаТабличногоДокумента.PDF);
	Исключение
		ВызватьИсключение "Ошибка записи акта: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	// Расшифровочная ведомость
	ИмяФайлаРасшВедомость = "Расш_ведомость_" + СокрЛП(ДокументСсылка.Номер) + "_" + СтрЗаменить(Формат(ДокументСсылка.Дата, "ДФ=dd.MM.yyyy"), ".","") + "_" + СтрЗаменить(Прав(ТекущаяДата(), 8), ":","") + ".pdf";
	ПолноеИмяФайлаРасшВедомость = КаталогФайлов + ИмяФайлаРасшВедомость;
	
	ПечатнаяФорма = Справочники.ВнешниеОбработки.НайтиПоНаименованию("Расшифровочная ведомость по премиям");
	ОбработкаОбъект = ПечатнаяФорма.ПолучитьОбъект();
	
	ИмяФайлаОтчета = ПолучитьИмяВременногоФайла("epf");
	ДанныеОбработки = ОбработкаОбъект.ХранилищеВнешнейОбработки.Получить();
	ДанныеОбработки.Записать(ИмяФайлаОтчета); 
	
	ПечатнаяФорма = ВнешниеОбработки.Создать(ИмяФайлаОтчета);
	ТабличныйДокумент = ПечатнаяФорма.Печать(ДокументСсылка);
	
	Попытка
		ТабличныйДокумент.Записать(ПолноеИмяФайлаРасшВедомость, ТипФайлаТабличногоДокумента.PDF);
	Исключение
		ВызватьИсключение "Ошибка записи расшифровочной ведомости: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат Новый Структура("ИмяФайла, ИмяФайлаРасшВедомость, ПолноеИмяФайла, ПолноеИмяФайлаРасшВедомость", ИмяФайла, ИмяФайлаРасшВедомость, ПолноеИмяФайла, ПолноеИмяФайлаРасшВедомость);
	
КонецФункции

Процедура ИнициироватьВыгрузкуОтправкуАктов(ДокументСсылка, ОтправлятьНаПочту = Ложь, ВыгружатьВОкноПоставщика = Истина) Экспорт
	
	лКлючАлгоритма = "ОбщийМодуль_БонусыПоставщиковСервер_ИнициироватьВыгрузкуОтправкуАктов";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	Попытка
		СтруктураАдресаФайлов = ЗаписатьФайлыДляВыгрузкиОтправкиПоставщикам(ДокументСсылка);
	Исключение
		ВызватьИсключение "Не удалось записать файлы по премиям 2% для документа UID: " + ДокументСсылка.УникальныйИдетификатор() + " + по причине: " + ОписаниеОшибки();
	КонецПопытки;
	
	Если ОтправлятьНаПочту Тогда
		ОтправитьДокументыНаПочтуПоставщика(ДокументСсылка, СтруктураАдресаФайлов);
	КонецЕсли;
	
	Если ВыгружатьВОкноПоставщика Тогда
		
		Попытка
			ВыгрузитьВОкноПоставщика(ДокументСсылка, СтруктураАдресаФайлов);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Акт №" + ДокументСсылка.Номер + " выгружен  в «Окно поставщика»");
		Исключение
			ВызватьИсключение "Не удалось выгрузить акт №" + ДокументСсылка.Номер + " в «Окно поставщика»." + ОписаниеОшибки();
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры
 
Процедура ОтправитьДокументыНаПочтуПоставщика(ДокументСсылка, СтруктураАдресаФайлов)
	
	лКлючАлгоритма = "ОбщийМодуль_БонусыПоставщиковСервер_ОтправитьДокументыНаПочтуПоставщика";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
		
	ТекстПисьма = Справочники.ШаблоныТекстовПисем.РасчетБонусаОтПоставщика.ТекстПисьма;
	
	Если Не Справочники.ШаблоныТекстовПисем.РасчетБонусаОтПоставщика.Используется Или Не ЗначениеЗаполнено(ТекстПисьма) Тогда
		ТекстПисьма = ПолучитьТекстПисьмаПоУмолчанию(ДокументСсылка);
	КонецЕсли;
	
	ТекстПисьма = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстПисьма, 
	ДокументСсылка.ПроцентБонуса, 
	ЧислоПрописью(ДокументСсылка.ПроцентБонуса,"НП=Ложь",",,,,,,,,0"));
	
	Склад = "Нижний_Новгород";
	
	ТемаПисьма = Справочники.ШаблоныТекстовПисем.РасчетБонусаОтПоставщика.ТемаПисьма;
	
	Если Не Справочники.ШаблоныТекстовПисем.РасчетБонусаОтПоставщика.Используется Или Не ЗначениеЗаполнено(ТемаПисьма) Тогда
		ТемаПисьма = "Акт о начислении премии за период: %1-%2! %3";
	КонецЕсли;	
	
	ТемаПисьма = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТемаПисьма, 
	Формат(ДокументСсылка.ПериодАнализаНачало, "ДФ=dd.MM.yyyy"),
	Формат(ДокументСсылка.ПериодАнализаОкончание, "ДФ=dd.MM.yyyy"),
	Склад);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Тема", ТемаПисьма);
	СтруктураПараметров.Вставить("ТекстПисьма", ТекстПисьма);
	
	СписокАдресатов = ПолучитьСписокАдресатов(ДокументСсылка);
	
	Событие = Справочники.СобытияДляОтправкиЭлектронныхПисем.РасчетПремии2Процента;
	
	Вложения = Новый СписокЗначений;
	Вложения.Добавить(Новый Структура("ИмяФайла, Хранилище", СтруктураАдресаФайлов.ИмяФайла, Новый ДвоичныеДанные(СтруктураАдресаФайлов.ПолноеИмяФайла)));
	Вложения.Добавить(Новый Структура("ИмяФайла, Хранилище", СтруктураАдресаФайлов.ИмяФайлаРасшВедомость, Новый ДвоичныеДанные(СтруктураАдресаФайлов.ПолноеИмяФайлаРасшВедомость)));
	
	УчетнаяЗаписьОтправителя = ПолучитьУчетнуюЗаписьОтправителя(ДокументСсылка);
	
	Попытка
		РассылкаСообщенийОбОшибках.ОтправитьЭлектронноеСообщениеБезСохранения(Событие, СтруктураПараметров.ТекстПисьма, СтруктураПараметров.Тема, 
		СписокАдресатов, "UTF8", , Вложения, УчетнаяЗаписьОтправителя);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Акт №" + ДокументСсылка.Номер + " отправлен!");
		
		ЗафиксироватьОтправкуАктаВДополнительныхСвойствах(ДокументСсылка);
		
	Исключение
		ВызватьИсключение "Не удалось отправить акт №" + ДокументСсылка.Номер + ". Описание ошибки:" + ОписаниеОшибки();
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьУчетнуюЗаписьОтправителя(ДокументСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	МенеджерыТорговыхТочекСрезПоследних.Менеджер КАК Менеджер,
	|	ДоступКУчетнойЗаписи.Ссылка КАК УчетнаяЗапись
	|ИЗ
	|	РегистрСведений.МенеджерыТорговыхТочек.СрезПоследних КАК МенеджерыТорговыхТочекСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УчетныеЗаписиЭлектроннойПочты.ДоступКУчетнойЗаписи КАК ДоступКУчетнойЗаписи
	|		ПО МенеджерыТорговыхТочекСрезПоследних.Менеджер.Пользователь = ДоступКУчетнойЗаписи.Пользователь
	|ГДЕ
	|	МенеджерыТорговыхТочекСрезПоследних.Контрагент = &Контрагент
	|	И МенеджерыТорговыхТочекСрезПоследних.ВидМенеджера = &ВидМенеджера
	|	И ДоступКУчетнойЗаписи.Запись";
	
	Запрос.УстановитьПараметр("Контрагент"	, ДокументСсылка.КонтрагентДебитор);
	Запрос.УстановитьПараметр("ВидМенеджера", ПредопределенноеЗначение("Перечисление.ВидыМенеджеров.Снабжения"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.УчетнаяЗапись;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьТекстПисьмаПоУмолчанию(ДокументСсылка)
	
	лКлючАлгоритма = "ОбщийМодуль_БонусыПоставщиковСервер_ПолучитьТекстПисьмаПоУмолчанию";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;
		Выполнить(лЗамена);
		Возврат АлгоритмыЗначениеВозврата;
	КонецЕсли;	
	///////////////////////////////////////////////////////////////////////////
	 
	ШаблонСообщения = 
	"Уважаемые коллеги!
	|
	|Направляем акт о начислении премии (согласно Приложения 4 к Оферте договора поставки)!
	|Данная премия начисляется 1 раз в квартал и составляет %1(%2%) от общей стоимости Товаров, отгруженных Покупателю Поставщиком за указанный период.
	|
	|Необходимо: 
	|• В срок до 17-го числа текущего месяца приложить скан подписанного и с печатью акта в личном кабинете Поставщика (окно поставщика – раздел Бонусы)
	|• В срок до 20-го числа текущего месяца направить оригинал подписанного и с печатью акта
	|
	|По всем вопросам просьба обращаться к Вашему личному менеджеру ПартКом. 
	|
	|С уважением,
	|Компания ПартКом.";
	
	Возврат ШаблонСообщения;
	
КонецФункции

Функция ПолучитьСписокАдресатов(ДокументСсылка)
	
	лКлючАлгоритма = "ОбщийМодуль_БонусыПоставщиковСервер_ПолучитьСписокАдресатов";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;
		Выполнить(лЗамена);
		Возврат АлгоритмыЗначениеВозврата;
	КонецЕсли;	
	///////////////////////////////////////////////////////////////////////////
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.АдресЭП КАК АдресЭлектроннойПочты
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|	И КонтактнаяИнформация.Вид В(&МассивВидов)
	|	И КонтактнаяИнформация.Объект = &Объект";
	
	МассивВидов = Новый Массив;
	
	МассивВидов.Добавить(ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.EmailДляОбменаДокументамиСКонтрагентами"));
	
	Запрос.УстановитьПараметр("МассивВидов", МассивВидов);
	Запрос.УстановитьПараметр("Объект", ДокументСсылка.КонтрагентДебитор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ВызватьИсключение "Не удалось определить адрес электронной почты контрагента " + ДокументСсылка.КонтрагентДебитор;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий(); 
	
	СписокАдресатов = Новый СписокЗначений;
	СписокАдресатов.Добавить(ВыборкаДетальныеЗаписи.АдресЭлектроннойПочты);
	
	Возврат СписокАдресатов;
	
КонецФункции

Процедура ЗафиксироватьОтправкуАктаВДополнительныхСвойствах(ДокументСсылка)
	лКлючАлгоритма = "ОбщийМодуль_БонусыПоставщиковСервер_ЗафиксироватьОтправкуАктаВДополнительныхСвойствах";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;	
	///////////////////////////////////////////////////////////////////////////
		
	МенеджерЗаписи = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = ДокументСсылка;
	МенеджерЗаписи.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.Бонус2_ДатаОтправкиДокументовНаПочту;
	МенеджерЗаписи.Значение = ТекущаяДатаСеанса();
	
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры

Процедура ПолучитьНовыеОтметкиСканПолученИзОкнаПоставщика() Экспорт
	
	лКлючАлгоритма = "ОбщийМодуль_БонусыПоставщиковСервер_ЗагрузитьДокументы";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;	
	///////////////////////////////////////////////////////////////////////////

	Если ОбщегоНазначения.ЭтоРабочаяИнформационнаяБаза() Тогда 
		ИмяРеквизита = "СтрокаДляРабочейБазы";
	Иначе	
		ИмяРеквизита = "СтрокаДляТестовойБазы";
	КонецЕсли;
	
	СтрокаПодключенияADO = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Справочники.НастройкиРеквизитовДляОбменов.СтрокаПодключенияADO, ИмяРеквизита);
	
	АдресСервераMySQL = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Справочники.НастройкиРеквизитовДляОбменов.АдресСервераОП, ИмяРеквизита); 
	ИмяБазы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Справочники.НастройкиРеквизитовДляОбменов.ИмяБазыОП, ИмяРеквизита);
	ИмяПользователя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Справочники.НастройкиРеквизитовДляОбменов.ИмяПользователяОП, ИмяРеквизита);
	ПарольПользователя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Справочники.НастройкиРеквизитовДляОбменов.ПарольОП, ИмяРеквизита);
	
	Если Не ЗначениеЗаполнено(АдресСервераMySQL) Тогда 
		ВызватьИсключение "В справочнике «НастройкиРеквизитовДляОбменов» не заполнен адрес сервера ОП";
	КонецЕсли;
	
	ТекЗагрузка_ИмяТаблицы = "export_bonus";
	ИмяТаблицы_exchange = "export_messages";
	
	СтрокаПодключенияADO = СтрЗаменить(СтрокаПодключенияADO, "%АдресСервера%", АдресСервераMySQL);
	СтрокаПодключенияADO = СтрЗаменить(СтрокаПодключенияADO, "%ИмяБазы%", ИмяБазы);
	СтрокаПодключенияADO = СтрЗаменить(СтрокаПодключенияADO, "%ИмяПользователя%", ИмяПользователя);
	СтрокаПодключенияADO = СтрЗаменить(СтрокаПодключенияADO, "%ПарольПользователя%", ПарольПользователя);
	
	ADOСоединение  = Новый COMОбъект("ADODB.Connection");
	ADOСоединение.ConnectionString = СтрокаПодключенияADO;
	ADOСоединение.ConnectionTimeout = 30;
	ADOСоединение.CommandTimeout = 6000;
	
	Попытка
		ADOСоединение.Open();
	Исключение
		ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки; 
	
	RS = Новый ComОбъект("ADODB.Recordset"); 
	RS.ActiveConnection = ADOСоединение;
	RS.CursorType = 3;
	RS.LockType = 2;
	
	// ****** проверка необходимости загрузки ******
	ТекстЗапроса_Поиск = "SELECT * FROM " + ИмяТаблицы_exchange;
	
	RS.Open(ТекстЗапроса_Поиск, ADOСоединение);
	
	МассивДокументов = Новый Массив;
		
	Пока RS.EOF() = 0 Цикл
		
		ИмяТаблицы = RS.Fields("table").Value;
		
		НомерДокумента = RS.Fields("record_id").Value;
		ID = XMLСтрока(RS.Fields("id").Value);
		
		RS.MoveNext();
		
		Если ИмяТаблицы <> "export_bonus" Тогда
			Продолжить;
		КонецЕсли;
		
		РезультатЗагрузки = ЗагрузитьОтметкуСканПолучен(НомерДокумента, RS, ADOСоединение); 
		
		Если РезультатЗагрузки = 0 Тогда
			// значит из-за блокировок базы не удалось зафиксировать изменения в 1С
			// и надо повторить загрузку ещё раз
			Продолжить;
		ИначеЕсли РезультатЗагрузки = 1 Тогда
			МассивДокументов.Добавить(НомерДокумента);
		ИначеЕсли РезультатЗагрузки = 2 Тогда
			// значит возникли ошибки, которые некуда записать (например при обработке заказа поставщику)
			// надо скопировать строку в спец.таблицу (1C_error_export_messages) перед удалением из сигнальной (ИмяТаблицы_exchange)
			// удалять из сигнальной надо, иначе ошибка будет повторяться (и отсылаться письмо) бесконечно
			ТекстЗапроса_Копирование = "INSERT INTO 1C_error_export_messages SELECT * FROM " + ИмяТаблицы_exchange + " WHERE id = " + ID;
			
			Command = Новый COMОбъект("ADODB.Command");
			Command.CommandTimeout = 100;
			Command.CommandText = ТекстЗапроса_Копирование;
			Command.CommandType = 1;
			Command.ActiveConnection = ADOСоединение;
			
			Попытка
				Command.Execute();
			Исключение
				МенеджерЗаписи = РегистрыСведений.КритическиеСобытияСистемы.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Событие = Справочники.СобытияДляОтправкиЭлектронныхПисем.ОшибкаЗагрузкиБонусовИзОП;
				МенеджерЗаписи.Период = ТекущаяДатаСеанса() + 1;
				МенеджерЗаписи.Пользователь = ПараметрыСеанса.ТекущийПользователь;
				МенеджерЗаписи.ОписаниеОшибки = 
				"Ошибка при загрузке документа из Окна поставщика. 
				|Не удалось скопировать строку из таблицы "+ИмяТаблицы_exchange+" в таблицу 1C_error_export_messages. ID="+ ID +" 
				|Описание ошибки: " + ОписаниеОшибки();
				МенеджерЗаписи.Записать();
				Продолжить;
			КонецПопытки;
		КонецЕсли;
		
		// ****** документ загрузили, теперь надо удалить запись об этом документе ******
		ТекстЗапроса_Удаление = "DELETE FROM " + ИмяТаблицы_exchange + " WHERE id = " + ID;
		
		Command = Новый COMОбъект("ADODB.Command");
		Command.CommandTimeout = 100;
		Command.CommandText = ТекстЗапроса_Удаление;
		Command.CommandType = 1;
		Command.ActiveConnection = ADOСоединение;
		
		Попытка
			Command.Execute();
		Исключение
			МенеджерЗаписи = РегистрыСведений.КритическиеСобытияСистемы.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Событие = Справочники.СобытияДляОтправкиЭлектронныхПисем.ОшибкаЗагрузкиБонусовИзОП;
			МенеджерЗаписи.Период = ТекущаяДатаСеанса();
			МенеджерЗаписи.Пользователь = ПараметрыСеанса.ТекущийПользователь;
			МенеджерЗаписи.ОписаниеОшибки = 
			"Ошибка при загрузке документа из Окна поставщика. 
			|Документ загружен, а запись в таблице "+ИмяТаблицы_exchange+" не удалена. ID= "+ ID;
			МенеджерЗаписи.Записать();
			Продолжить;
		КонецПопытки;
	КонецЦикла;	
	
	Если МассивДокументов.Количество() Тогда
		
		НомераДокументов = "";
		Для Каждого ОбработанныйДокумент Из МассивДокументов Цикл
			НомераДокументов = НомераДокументов + "/" + ОбработанныйДокумент;
		КонецЦикла;
		
		МенеджерЗаписи = РегистрыСведений.КритическиеСобытияСистемы.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Событие = Справочники.СобытияДляОтправкиЭлектронныхПисем.ЗагрузкаБонусовИзОП;
		МенеджерЗаписи.Период = ТекущаяДатаСеанса();
		МенеджерЗаписи.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		ОписаниеОшибки = "Закончена загрузка отметки «Скан получен» из «Окна поставщика». Обработаны документы: %1";
		ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ОписаниеОшибки, НомераДокументов);
		МенеджерЗаписи.ОписаниеОшибки = ОписаниеОшибки;
		МенеджерЗаписи.Записать();
	КонецЕсли;
	
КонецПроцедуры

Функция ЗагрузитьОтметкуСканПолучен(НомерДокумента, RS, ADOСоединение)
	
	лКлючАлгоритма = "ОбщийМодуль_БонусыПоставщиковСервер_ЗагрузитьОтметкуСканПолучен";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;
		Выполнить(лЗамена);
		Возврат АлгоритмыЗначениеВозврата;
	КонецЕсли;	
	///////////////////////////////////////////////////////////////////////////

	НомерДокумента = Лев(НомерДокумента, СтрДлина(НомерДокумента)-5);
	
	Если СтрДлина(НомерДокумента) < 11 Тогда 
		НомерДокумента = Лев(НомерДокумента,4)+"0"+Сред(НомерДокумента,5);
	КонецЕсли;
	
	ДатаДокумента = Дата(Число(Прав(НомерДокумента, 4)), 1, 1);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КорректировкаДолга.Ссылка
	|ИЗ
	|	Документ.КорректировкаДолга КАК КорректировкаДолга
	|ГДЕ
	|	КорректировкаДолга.Номер = &Номер
	|	И НАЧАЛОПЕРИОДА(КорректировкаДолга.Дата, ГОД) = &Дата");
	
	Запрос.УстановитьПараметр("Номер", НомерДокумента);
	Запрос.УстановитьПараметр("Дата", ДатаДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		МенеджерЗаписи = РегистрыСведений.КритическиеСобытияСистемы.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Событие = Справочники.СобытияДляОтправкиЭлектронныхПисем.ОшибкаЗагрузкиБонусовИзОП;
		МенеджерЗаписи.Период = ТекущаяДатаСеанса();
		МенеджерЗаписи.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		МенеджерЗаписи.ОписаниеОшибки = 
		"Ошибка при загрузке отметки «Скан получен» из Окна поставщика. 
		|Не найден документ «Корректировка долга» по номеру документа: " + НомерДокумента;
		МенеджерЗаписи.Записать();
		Возврат 2;
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ДокументСсылка = Выборка.Ссылка;
	
	// обработаем шапку
	ТекстЗапроса_Поиск = "SELECT * FROM export_bonus WHERE act_number = '"+НомерДокумента+"'";
	
	Command = Новый COMОбъект("ADODB.Command");
	Command.CommandTimeout = 100;
	Command.CommandText = ТекстЗапроса_Поиск;
	Command.CommandType = 1;
	Command.ActiveConnection = ADOСоединение;
	
	Попытка
		RSS = Command.Execute();
	Исключение
		МенеджерЗаписи = РегистрыСведений.КритическиеСобытияСистемы.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Событие = Справочники.СобытияДляОтправкиЭлектронныхПисем.ОшибкаЗагрузкиБонусовИзОП;
		МенеджерЗаписи.Период = ТекущаяДатаСеанса();
		МенеджерЗаписи.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		МенеджерЗаписи.ОписаниеОшибки = 
		"Ошибка при загрузке ответа из Окна поставщика. 
		|Ошибка загрузки отметки «скан получен» для корректировка долга. 
		|Запрос к таблицам MySQL вызвал ошибку. Описание ошибки: " +ОписаниеОшибки();
		МенеджерЗаписи.Записать();
	КонецПопытки;
	
	ЕстьДанные = Ложь;
	
	Пока RSS.EOF() = 0 Цикл
		ЕстьДанные = Истина;
		СканПолучен = RSS.Fields("has_scan").Value;
		RSS.MoveNext();
	КонецЦикла;
	
	Если Не ЕстьДанные Тогда
		Возврат 0;
	КонецЕсли;
	
	ТекстЗапроса_Поиск = "SELECT * FROM import_bonus WHERE act_number = '"+НомерДокумента+"'";
	
	Command = Новый COMОбъект("ADODB.Command");
	Command.CommandTimeout = 100;
	Command.CommandText = ТекстЗапроса_Поиск;
	Command.CommandType = 1;
	Command.ActiveConnection = ADOСоединение;
	
	Попытка
		Command.Execute();
	Исключение
		МенеджерЗаписи = РегистрыСведений.КритическиеСобытияСистемы.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Событие = Справочники.СобытияДляОтправкиЭлектронныхПисем.ОшибкаЗагрузкиБонусовИзОП;
		МенеджерЗаписи.Период = ТекущаяДатаСеанса();
		МенеджерЗаписи.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		МенеджерЗаписи.ОписаниеОшибки = 
		"Ошибка при загрузке ответа из Окна поставщика. 
		|Ошибка загрузки отметки «Скан получен» для корректировка долга. 
		|Запрос к таблицам MySQL вызвал ошибку. Описание ошибки: " +  ОписаниеОшибки();
		МенеджерЗаписи.Записать();
		Возврат 0;
	КонецПопытки;
	
	ТекстЗапроса_Обновление = "UPDATE import_bonus SET has_scan = " + СканПолучен + " WHERE act_number = '" + НомерДокумента + "'";
	
	Command = Новый COMОбъект("ADODB.Command");
	Command.CommandTimeout = 100;
	Command.CommandText = ТекстЗапроса_Обновление;
	Command.CommandType = 1;
	Command.ActiveConnection = ADOСоединение;
	
	Попытка
		Command.Execute();
	Исключение
		МенеджерЗаписи = РегистрыСведений.КритическиеСобытияСистемы.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Событие = Справочники.СобытияДляОтправкиЭлектронныхПисем.ОшибкаЗагрузкиБонусовИзОП;
		МенеджерЗаписи.Период = ТекущаяДатаСеанса();
		МенеджерЗаписи.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		МенеджерЗаписи.ОписаниеОшибки = 
		"Ошибка при загрузке ответа из Окна поставщика.
		|Запрос на обновление записи об ошибке в таблицу MySQL вызвал ошибку. Описание ошибки: " + ОписаниеОшибки();		
		МенеджерЗаписи.Записать();
		Возврат 0;
	КонецПопытки;

	ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
	ДокументОбъект.СканПолучен = СканПолучен;
	
	Попытка
		ДокументОбъект.Записать();
	Исключение
		МенеджерЗаписи = РегистрыСведений.КритическиеСобытияСистемы.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Событие = Справочники.СобытияДляОтправкиЭлектронныхПисем.ОшибкаЗагрузкиБонусовИзОП;
		МенеджерЗаписи.Период = ТекущаяДатаСеанса();
		МенеджерЗаписи.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		МенеджерЗаписи.ОписаниеОшибки = 
		"Ошибка при загрузке ответа из Окна поставщика.
		|Не удалось записать документ " + ДокументОбъект.Номер + "
		|Описание ошибки: " + ОписаниеОшибки();
		МенеджерЗаписи.Записать();
		Возврат 0;
	КонецПопытки;
	
	Возврат 1;
	
КонецФункции

// 15.04.19 Строганов Роман <
